{
  "clinicians": [
    {
      "id": "dr-house",
      "name": "Dr. Gregory House",
      "specialty": "Internal Medicine"
    }
  ],
  "patients": [
    {
      "id": "patient-001",
      "name": "John Smith",
      "dob": "1965-03-15",
      "mrn": "MRN-12345"
    },
    {
      "id": "patient-002",
      "name": "Jane Doe",
      "dob": "1978-07-22",
      "mrn": "MRN-67890"
    },
    {
      "id": "patient-003",
      "name": "Robert Johnson",
      "dob": "1952-11-08",
      "mrn": "MRN-11111"
    }
  ],
  "encounters": [
    {
      "status": "signed",
      "patient_id": "patient-001",
      "transcript": "Doctor: Good morning, Mr. Smith. How are you feeling today?\nPatient: Not great, doc. I've had this persistent cough for about two weeks now.\nDoctor: Two weeks. Any other symptoms?\nPatient: Yeah, I've been really tired and I get short of breath when I climb stairs.\nDoctor: Let me listen to your lungs. Take a deep breath... and again.\nPatient: *coughing*\nDoctor: Your lungs sound clear. No fever?\nPatient: No, but I've been sweating at night.\nDoctor: Any weight loss?\nPatient: Maybe a few pounds, but I've been eating less.\nDoctor: Given your history of smoking, I'd like to order a chest X-ray and some blood work.\nPatient: Is it serious, doctor?\nDoctor: Let's not jump to conclusions. We'll get some tests and go from there.",
      "soap_note": "## Subjective\nMr. John Smith, 59-year-old male, presents with 2-week history of persistent cough associated with fatigue and exertional dyspnea. Patient reports night sweats and unintentional weight loss of approximately 5 lbs. No fever. 40 pack-year smoking history, quit 5 years ago.\n\n## Objective\nVital Signs: BP 128/82, HR 88, RR 18, SpO2 96% RA, Temp 97.8F\nGeneral: Alert, cooperative, no acute distress\nRespiratory: Lungs clear to auscultation bilaterally, no wheezes or rales\n\n## Assessment\n1. Chronic cough - differential includes post-viral, GERD, tobacco-related lung disease\n2. Unintentional weight loss with night sweats - requires evaluation for underlying etiology\n\n## Plan\n1. Chest X-ray to rule out infiltrates/masses\n2. CBC, CMP, ESR/CRP\n3. Follow up in 1 week with results\n4. Smoking cessation reinforcement\n5. Consider chest CT if X-ray abnormal or symptoms persist",
      "id": "encounter-001",
      "clinician_id": "dr-house",
      "created_at": "2026-01-21T11:44:33.778845",
      "updated_at": "2026-01-21T11:44:33.778853"
    },
    {
      "status": "draft",
      "patient_id": "patient-002",
      "transcript": "Doctor: Hi Jane, what brings you in today?\nPatient: I've been having really bad headaches for the past month.\nDoctor: Can you describe the pain? Where is it located?\nPatient: Mostly on the right side of my head, around my eye.\nDoctor: Throbbing or constant?\nPatient: Throbbing, like a heartbeat. Light hurts my eyes.\nDoctor: How often do these headaches occur?\nPatient: Maybe 2-3 times a week. They last all day sometimes.\nDoctor: Any nausea with them?\nPatient: Yes, I've thrown up a couple times.\nDoctor: Any family history of migraines?\nPatient: My mom gets bad headaches too.\nDoctor: Based on your symptoms, this sounds like migraine headaches.",
      "soap_note": null,
      "id": "encounter-002",
      "clinician_id": "dr-house",
      "created_at": "2026-01-20T11:44:33.778856",
      "updated_at": "2026-01-21T11:44:33.778859"
    },
    {
      "status": "processing",
      "patient_id": "patient-003",
      "transcript": "Doctor: Mr. Johnson, let's review your blood pressure readings from home.\nPatient: Okay. I've been taking them like you said.\nDoctor: This morning it was 148/92?\nPatient: Yes, but I was worried about coming to the appointment.\nDoctor: That's understandable. Last week you had 142/88.\nPatient: Is that better?\nDoctor: It's still above our target of 130/80. Are you taking your medications?\nPatient: Yes, every morning with breakfast.\nDoctor: Have you been following the low-sodium diet?\nPatient: I've tried, but it's hard.\nDoctor: I understand. Let's discuss some strategies to reduce sodium intake.",
      "soap_note": null,
      "id": "encounter-003",
      "clinician_id": "dr-house",
      "created_at": "2026-01-19T11:44:33.778862",
      "updated_at": "2026-01-21T11:44:33.778864"
    }
  ]
}